Merging DataFrames

In [2]:
import pandas as pd

In [3]:
employeesName={
    "ID":[1,2,3],
    "Name":["Alice","Bob","Charlie"]
}

employeesAge={
    "ID":[1,2,4],
    "Age":[23,30,25]
}

df1=pd.DataFrame(employeesName)
df1

   ID     Name
0   1    Alice
1   2      Bob
2   3  Charlie

In [4]:
df2=pd.DataFrame(employeesAge)

df2

   ID  Age
0   1   23
1   2   30
2   4   25

In [6]:
inner_merged_df=pd.merge(df1,df2,on="ID",how="inner")

inner_merged_df

   ID   Name  Age
0   1  Alice   23
1   2    Bob   30

In [7]:
left_merged_df=pd.merge(df1,df2,on="ID",how="left")
left_merged_df

   ID     Name   Age
0   1    Alice  23.0
1   2      Bob  30.0
2   3  Charlie   NaN

In [16]:
drop_df=left_merged_df.fillna(0)
drop_df

   ID     Name   Age
0   1    Alice  23.0
1   2      Bob  30.0
2   3  Charlie   0.0